# Pandas

Pandas es un paquete de Python que provee dos estructuras de datos para el análisis de datos "relacionales" de manera rápida, flexible y expresiva. Pandas está construido sobre Numpy, por lo que muchas de las ventajas de utilizar Numpy se trasladan a Pandas.

Pandas puede ser utilizado para trabajar con diferentes tipos de datos:

* Tabulares, con datos en columnas que comparten un mismo tipo (por ejemplo, tablas de una base de datos y hojas de Excel).
* Series de tiempo.
* Matrices con columnas y filas etiquetadas.
* Datos de experimentos estadísticos en general.

In [1]:
#pd es el alias comun de pandas
import pandas as pd
import numpy as np

# Estructuras

## Series

La primera estructura de datos de Pandas son las [Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html#series). Una Serie es utilizada para arreglos 1D etiquetados con un mismo tipo de dato en todos sus elementos. Una serie es un arreglo 1D donde cada elemento tiene asignado un índice:


| index   || |
|---||----|
| a || s1 |
| b || s2 |
| c || s3 |
| ... || ... |

In [2]:
#un objeto series desde una lista
s1 = pd.Series(data=[1, 1, 2, 3, 5], index=["a", "b", "c", "d", "e"])
s1

a    1
b    1
c    2
d    3
e    5
dtype: int64

## Dataframe

Los [Dataframes](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html#dataframe) son la segunda estructura en Pandas, éstos son utilizados para datos 2D etiquetados (columnas con nombres generalmente). Las columnas de un Dataframe pueden tener tipos de dato diferentes. Puedes pensar en un Dataframe  como un contenedor de Series, donde cada columna es una Serie (arreglo 1D con etiquetas). Un Dataframe puede representarse como una tabla donde cada fila tiene asignado un índice y cada columna un nombre:

| index\columns  || A  | B  | C  | D  |
|---||----|----|----|----|
| 1 || a1 | b1 | c1 | d1 |
| 2 || a2 | b2 | c2 | d2 |
| 3 || a3 | b3 | c3 | d3 |

In [3]:
#un dataframe aleatorio con numpy random
df = pd.DataFrame(np.random.randn(6, 4), columns=["A", "B", "C", "D"])
df

          A         B         C         D
0  0.755884 -0.839998 -0.053755 -0.077367
1 -0.159911  0.247120  0.720626 -0.364441
2 -0.596288  0.481640 -2.507039 -0.262860
3 -0.578096  0.128052 -1.577188  0.845205
4 -0.139377  1.896498  0.131219  0.058248
5 -0.542045  1.181246 -0.999022 -0.088826

### Axes

Recuerda que los axes de un Dataframe (una tabla 2D), son los siguientes:

![Numpy/Pandas axes](https://raw.githubusercontent.com/jhermosillo/DIPLOMADO_CDP/main/01%20Programaci%C3%B3n%20en%20Python/images/axes.png)

# Creación y almacenamiento

## Creación desde diccionarios de listas

In [4]:
#Un diccionario de python
dict1 = {'pais': ['Mexico',
'EUA', "Francia"], 'continente': ["America", "America", "Europa"], 'poblacion': [129, 325, 67]}

paises = pd.DataFrame(dict1)
paises

      pais continente  poblacion
0   Mexico    America        129
1      EUA    America        325
2  Francia     Europa         67

## Creación desde diccionario anidado

In [5]:
#Un diccionario anidado de python
#las claves anidadas especifican el indice de las filas
dict2 = {'pais': {"p1": 'Mexico',
"p2": 'EUA', "p3": "Francia"}, 'continente': {"p1": "America", "p2": "America", "p3": "Europa"}, 'poblacion': {"p1": 129, "p2": 325, "p3": 67}}

paises = pd.DataFrame(dict2)
paises

       pais continente  poblacion
p1   Mexico    America        129
p2      EUA    America        325
p3  Francia     Europa         67

## Creación desde archivos csv

In [6]:
!ls sample_data/

california_housing_test.csv
california_housing_train.csv

In [7]:
#leamos un archivo csv almacenado por colab
cali_housing = pd.read_csv("./sample_data/california_housing_test.csv", nrows=10)
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
3,-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
4,-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0
5,-119.56,36.51,37.0,1018.0,213.0,663.0,204.0,1.6635,67000.0
6,-121.43,38.63,43.0,1009.0,225.0,604.0,218.0,1.6641,67000.0
7,-120.65,35.48,19.0,2310.0,471.0,1341.0,441.0,3.2250,166900.0
8,-122.84,38.40,15.0,3080.0,617.0,1446.0,599.0,3.6696,194400.0
9,-118.02,34.08,31.0,2402.0,632.0,2830.0,603.0,2.3333,164200.0

## Creación desde archivos excel

In [8]:
# Cargar un archivo de excel a colab desde github
!apt-get install subversion
!svn checkout "https://github.com/DCDPUAEM/DCDP_2022/trunk/01%20Programaci%C3%B3n%20en%20Python/data/"

"apt-get" no se reconoce como un comando interno o externo,
programa o archivo por lotes ejecutable.
"svn" no se reconoce como un comando interno o externo,
programa o archivo por lotes ejecutable.

In [11]:
# En caso de ser necesario
#!pip install openpyxl --upgrade --pre

Collecting openpyxl
  Downloading openpyxl-3.0.10-py2.py3-none-any.whl (242 kB)
Requirement already satisfied, skipping upgrade: et-xmlfile in c:\anaconda3\lib\site-packages (from openpyxl) (1.0.1)
Installing collected packages: openpyxl
  Attempting uninstall: openpyxl
    Found existing installation: openpyxl 3.0.3
    Uninstalling openpyxl-3.0.3:
      Successfully uninstalled openpyxl-3.0.3
Successfully installed openpyxl-3.0.10

In [14]:
#cargar el archivo en formato xls a un pandas dataframe
cali_housing = pd.read_excel("../data/california_housing_test.xlsx", index_col=0)
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700
1,-118.30,34.26,43,1510,310,809,277,3.5990,176500
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500
3,-118.36,33.82,28,67,15,49,11,6.1359,330000
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700
...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001

## Persistencia a disco

In [ ]:
cali_housing.to_csv("cali_housing.csv")
#o en formato de excel:
cali_housing.to_excel("cali_housing.xlsx")

Ahora se crearon dos archivos en colab

In [ ]:
!ls

## Otros formatos

Además de los ya mencionados, Pandas permite leer y escribir en formatos comúnes como:

* JSON
* HTML
* Parquet
* SQL
* BigQuery

Puedes ver la lista completa en la [documentación de Pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#io-tools-text-csv-hdf5).

# Accediendo a los datos

## info()

El método [```info()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.info.html) puede usarse para mostrar la información general del objeto de Pandas, como el índice y los tipos de datos usados.

In [15]:
cali_housing.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3000 entries, 0 to 2999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           3000 non-null   float64
 1   latitude            3000 non-null   float64
 2   housing_median_age  3000 non-null   int64
 3   total_rooms         3000 non-null   int64
 4   total_bedrooms      3000 non-null   int64
 5   population          3000 non-null   int64
 6   households          3000 non-null   int64
 7   median_income       3000 non-null   float64
 8   median_house_value  3000 non-null   int64
dtypes: float64(3), int64(6)
memory usage: 234.4 KB

## head() y tail()

Los métodos [```head()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html) y [```tail()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html#pandas.DataFrame.tail) devuelven una pequeña muestra de los primeros o últimos elementos de un objeto Series o Dataframe. Ambas pueden recibir como parámetro el número de elementos que se desean visualizar, por defecto es igual a 5.

In [16]:
cali_housing.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700
1,-118.30,34.26,43,1510,310,809,277,3.5990,176500
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500
3,-118.36,33.82,28,67,15,49,11,6.1359,330000
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700

In [17]:
cali_housing.tail(3)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001

## sample()

[```df.sample()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html) retorna una muestra aleatoria del objeto.

In [18]:
cali_housing.sample(n=3)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
1601,-122.27,40.39,26,1833,422,939,408,1.3571,59000
2034,-122.08,37.72,32,2476,368,1048,367,5.6194,274700
2153,-122.11,37.40,15,255,63,138,74,4.6591,175000

## index

El atributo [```df.index```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.index.html) regresa el índice del objeto de Pandas.

In [19]:
cali_housing.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            2990, 2991, 2992, 2993, 2994, 2995, 2996, 2997, 2998, 2999],
           dtype='int64', length=3000)

## df.columns

El atributo [```df.columns```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.columns.html) de un DataFrame devuelve las columnas del mismo.

In [20]:
cali_housing.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

## df.describe()

El método [```describe()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html) regresa un resúmen estadístico del objeto.

In [21]:
cali_housing.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,3000.000000,3000.00000,3000.000000,3000.000000,3000.000000,3000.000000,3000.00000,3000.000000,3000.00000
mean,-119.589200,35.63539,28.845333,2599.578667,529.950667,1402.798667,489.91200,3.807272,205846.27500
std,1.994936,2.12967,12.555396,2155.593332,415.654368,1030.543012,365.42271,1.854512,113119.68747
min,-124.180000,32.56000,1.000000,6.000000,2.000000,5.000000,2.00000,0.499900,22500.00000
25%,-121.810000,33.93000,18.000000,1401.000000,291.000000,780.000000,273.00000,2.544000,121200.00000
50%,-118.485000,34.27000,29.000000,2106.000000,437.000000,1155.000000,409.50000,3.487150,177650.00000
75%,-118.020000,37.69000,37.000000,3129.000000,636.000000,1742.750000,597.25000,4.656475,263975.00000
max,-114.490000,41.92000,52.000000,30450.000000,5419.000000,11935.000000,4930.00000,15.000100,500001.00000

# Selección - asignación

## Seleccionando columnas

Puedes usar dos notaciones para seleccionar una columna de un DataFrame, cualquiera de éstas devolverá un objeto Series.



```
df.["A"]
```

o



```
df.A
```

In [22]:
#seleccionar la columna devuelve un objeto Series
cali_housing["latitude"]

0       37.37
1       34.26
2       33.78
3       33.82
4       36.33
        ...
2995    34.42
2996    34.06
2997    36.30
2998    34.10
2999    34.42
Name: latitude, Length: 3000, dtype: float64

In [23]:
#usa segunda opcion para seleccionar columnas
cali_housing.latitude

0       37.37
1       34.26
2       33.78
3       33.82
4       36.33
        ...
2995    34.42
2996    34.06
2997    36.30
2998    34.10
2999    34.42
Name: latitude, Length: 3000, dtype: float64

In [24]:
#seleccionando una columna como un dataframe
cali_housing[["latitude"]]

      latitude
0        37.37
1        34.26
2        33.78
3        33.82
4        36.33
...        ...
2995     34.42
2996     34.06
2997     36.30
2998     34.10
2999     34.42

[3000 rows x 1 columns]

Seleccionando múltiples columnas



```
df[["A", ...]]
```

In [25]:
cali_housing[["longitude", "latitude"]]

      longitude  latitude
0       -122.05     37.37
1       -118.30     34.26
2       -117.81     33.78
3       -118.36     33.82
4       -119.67     36.33
...         ...       ...
2995    -119.86     34.42
2996    -118.14     34.06
2997    -119.70     36.30
2998    -117.12     34.10
2999    -119.63     34.42

[3000 rows x 2 columns]

## Seleccionando filas con slicing

In [26]:
cali_housing[0:3]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700
1,-118.30,34.26,43,1510,310,809,277,3.5990,176500
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500

## Selección con etiquetas loc

In [27]:
cali_housing.loc[:, "total_rooms":"households"]

      total_rooms  total_bedrooms  population  households
0            3885             661        1537         606
1            1510             310         809         277
2            3589             507        1484         495
3              67              15          49          11
4            1241             244         850         237
...           ...             ...         ...         ...
2995         1450             642        1258         607
2996         5257            1082        3496        1036
2997          956             201         693         220
2998           96              14          46          14
2999         1765             263         753         260

[3000 rows x 4 columns]

## Selección con enteros iloc

In [28]:
cali_housing.iloc[:, 6:]

      households  median_income  median_house_value
0            606         6.6085              344700
1            277         3.5990              176500
2            495         5.7934              270500
3             11         6.1359              330000
4            237         2.9375               81700
...          ...            ...                 ...
2995         607         1.1790              225000
2996        1036         3.3906              237200
2997         220         2.2895               62000
2998          14         3.2708              162500
2999         260         8.5608              500001

[3000 rows x 3 columns]

## Asignación por rango

In [29]:
#primero agregamos una columna random inicializada a 0
cali_housing["random"] = 0.0
#reasignamos usando np.random
cali_housing.loc[:, "random"] = np.random.randn(cali_housing.shape[0])
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454
1,-118.30,34.26,43,1510,310,809,277,3.5990,176500,0.970595
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649
3,-118.36,33.82,28,67,15,49,11,6.1359,330000,-0.117505
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700,1.061560
...,...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000,-0.153826
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200,0.246395
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000,-0.612814
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500,-2.012305
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001,0.335743

## Selección con indexación booleana

In [30]:
cali_housing[cali_housing["population"] > 1000]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649
7,-120.65,35.48,19,2310,471,1341,441,3.2250,166900,-0.160045
8,-122.84,38.40,15,3080,617,1446,599,3.6696,194400,-1.885860
9,-118.02,34.08,31,2402,632,2830,603,2.3333,164200,-0.563342
...,...,...,...,...,...,...,...,...,...,...
2988,-122.01,36.97,43,2162,509,1208,464,2.5417,260900,0.203849
2989,-122.02,37.60,32,1295,295,1097,328,3.2386,149600,-0.130809
2990,-118.23,34.09,49,1638,456,1500,430,2.6923,150000,0.337569
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000,-0.153826
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200,0.246395

## Selección de celdas con at y iat

[```at```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.at.html) utiliza etiquetas para seleccionar elementos:

In [31]:
cali_housing.at[0, "housing_median_age"]

27

[```iat```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iat.html#pandas.DataFrame.iat) utiliza enteros para seleccionar elementos:

In [32]:
cali_housing.iat[1, 4]

310

## Asignación elemento

También puedes cambir el contenido de las celdas directamente mediante asignación:

In [33]:
cali_housing.iat[1, 4] = 200.0
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454
1,-118.30,34.26,43,1510,200,809,277,3.5990,176500,0.970595
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649
3,-118.36,33.82,28,67,15,49,11,6.1359,330000,-0.117505
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700,1.061560
...,...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000,-0.153826
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200,0.246395
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000,-0.612814
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500,-2.012305
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001,0.335743

## Otros
Otros métodos de selección que podrían ser útiles:

* [```idxmax()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmax.html)
* [```idxmin()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmin.html#pandas.DataFrame.idxmin)
* [```filter()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.filter.html)
* [```take()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.take.html)
* [```truncate()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.truncate.html)

Puedes ver la lista completa de métodos para la selección, re-indexado y manipulación de etiquetas en la [documentación de Pandas](https://pandas.pydata.org/docs/reference/frame.html#reindexing-selection-label-manipulation).

# Atributos

* [```df.T```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.T.html)
* [```df.axes```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.axes.html#pandas.DataFrame.axes)
* [```df.dtypes```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dtypes.html#pandas.DataFrame.dtypes)
* [```df.shape```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html#pandas.DataFrame.shape)
* [```df.size```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.size.html#pandas.DataFrame.size)
* [```df.values```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.values.html#pandas.DataFrame.values)

## df.T

La transpuesta de df (filas y columnas intercambiadas):

In [34]:
#Los indices pasan a ser los nombres de las columnas, las columnas a indices
cali_housing.T

,0,1,2,3,4,5,6,7,8,9,...,2990,2991,2992,2993,2994,2995,2996,2997,2998,2999
longitude,-122.050000,-118.300000,-117.810000,-118.360000,-119.67000,-119.560000,-121.430000,-120.650000,-122.84000,-118.020000,...,-118.230000,-117.170000,-122.330000,-117.91000,-117.93000,-119.860000,-118.140000,-119.700000,-117.120000,-119.630000
latitude,37.370000,34.260000,33.780000,33.820000,36.33000,36.510000,38.630000,35.480000,38.40000,34.080000,...,34.090000,34.280000,37.390000,33.60000,33.86000,34.420000,34.060000,36.300000,34.100000,34.420000
housing_median_age,27.000000,43.000000,27.000000,28.000000,19.00000,37.000000,43.000000,19.000000,15.00000,31.000000,...,49.000000,13.000000,52.000000,37.00000,35.00000,23.000000,27.000000,10.000000,40.000000,42.000000
total_rooms,3885.000000,1510.000000,3589.000000,67.000000,1241.00000,1018.000000,1009.000000,2310.000000,3080.00000,2402.000000,...,1638.000000,4867.000000,573.000000,2088.00000,931.00000,1450.000000,5257.000000,956.000000,96.000000,1765.000000
total_bedrooms,661.000000,200.000000,507.000000,15.000000,244.00000,213.000000,225.000000,471.000000,617.00000,632.000000,...,456.000000,718.000000,102.000000,510.00000,181.00000,642.000000,1082.000000,201.000000,14.000000,263.000000
population,1537.000000,809.000000,1484.000000,49.000000,850.00000,663.000000,604.000000,1341.000000,1446.00000,2830.000000,...,1500.000000,780.000000,232.000000,673.00000,516.00000,1258.000000,3496.000000,693.000000,46.000000,753.000000
households,606.000000,277.000000,495.000000,11.000000,237.00000,204.000000,218.000000,441.000000,599.00000,603.000000,...,430.000000,250.000000,92.000000,390.00000,174.00000,607.000000,1036.000000,220.000000,14.000000,260.000000
median_income,6.608500,3.599000,5.793400,6.135900,2.93750,1.663500,1.664100,3.225000,3.66960,2.333300,...,2.692300,7.199700,6.226300,5.10480,5.58670,1.179000,3.390600,2.289500,3.270800,8.560800
median_house_value,344700.000000,176500.000000,270500.000000,330000.000000,81700.00000,67000.000000,67000.000000,166900.000000,194400.00000,164200.000000,...,150000.000000,253800.000000,500001.000000,500001.00000,182500.00000,225000.000000,237200.000000,62000.000000,162500.000000,500001.000000
random,2.042454,0.970595,-0.054649,-0.117505,1.06156,0.852492,-0.654469,-0.160045,-1.88586,-0.563342,...,0.337569,0.979213,-0.742893,-0.08663,-0.50174,-0.153826,0.246395,-0.612814,-2.012305,0.335743

## df.axes

Retorna información sobre los axes que componen al objeto:

In [35]:
cali_housing.axes

[Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
             ...
             2990, 2991, 2992, 2993, 2994, 2995, 2996, 2997, 2998, 2999],
            dtype='int64', length=3000),
 Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
        'total_bedrooms', 'population', 'households', 'median_income',
        'median_house_value', 'random'],
       dtype='object')]

## df.dtypes

Retorna los tipos de datos utilizados por el objeto:

In [36]:
cali_housing.dtypes

longitude             float64
latitude              float64
housing_median_age      int64
total_rooms             int64
total_bedrooms          int64
population              int64
households              int64
median_income         float64
median_house_value      int64
random                float64
dtype: object

## df.shape

La forma del objeto (número de filas y columnas en un DataFrame):

In [37]:
cali_housing.shape

(3000, 10)

## df.size

El número de elementos en el objeto (número de celdas en un DataFrame):

In [38]:
cali_housing.size

30000

## df.values

Retorna el objeto de Pandas como un arreglo de Numpy:

In [39]:
cali_housing.values

array([[-1.22050000e+02,  3.73700000e+01,  2.70000000e+01, ...,
         6.60850000e+00,  3.44700000e+05,  2.04245378e+00],
       [-1.18300000e+02,  3.42600000e+01,  4.30000000e+01, ...,
         3.59900000e+00,  1.76500000e+05,  9.70594630e-01],
       [-1.17810000e+02,  3.37800000e+01,  2.70000000e+01, ...,
         5.79340000e+00,  2.70500000e+05, -5.46488725e-02],
       ...,
       [-1.19700000e+02,  3.63000000e+01,  1.00000000e+01, ...,
         2.28950000e+00,  6.20000000e+04, -6.12813527e-01],
       [-1.17120000e+02,  3.41000000e+01,  4.00000000e+01, ...,
         3.27080000e+00,  1.62500000e+05, -2.01230455e+00],
       [-1.19630000e+02,  3.44200000e+01,  4.20000000e+01, ...,
         8.56080000e+00,  5.00001000e+05,  3.35742785e-01]])

# Eliminación

## Remover filas o columnas con df.drop()

El método [```drop()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html) permite eliminar filas o columnas al especificar el axis correspondiente, puedes eliminar más de una usando una lista como parámetro:

In [40]:
#primero agregamos dos nuevas columnas
cali_housing["temp"] = "temp"
cali_housing["temp2"] = cali_housing["temp"] + "2"
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random,temp,temp2
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454,temp,temp2
1,-118.30,34.26,43,1510,200,809,277,3.5990,176500,0.970595,temp,temp2
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649,temp,temp2
3,-118.36,33.82,28,67,15,49,11,6.1359,330000,-0.117505,temp,temp2
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700,1.061560,temp,temp2
...,...,...,...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000,-0.153826,temp,temp2
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200,0.246395,temp,temp2
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000,-0.612814,temp,temp2
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500,-2.012305,temp,temp2
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001,0.335743,temp,temp2

Eliminar columnas con axis = 1

In [41]:
#drop devuelve un nuevo dataframe sin la columna
df = cali_housing.drop(["temp", "temp2"], axis=1)
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454
1,-118.30,34.26,43,1510,200,809,277,3.5990,176500,0.970595
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649
3,-118.36,33.82,28,67,15,49,11,6.1359,330000,-0.117505
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700,1.061560
...,...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000,-0.153826
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200,0.246395
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000,-0.612814
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500,-2.012305
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001,0.335743

Eliminar filas con axis = 0

In [42]:
#drop devuelve un nuevo dataframe sin la fila
df = cali_housing.drop([5,7,9], axis=0)
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random,temp,temp2
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454,temp,temp2
1,-118.30,34.26,43,1510,200,809,277,3.5990,176500,0.970595,temp,temp2
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649,temp,temp2
3,-118.36,33.82,28,67,15,49,11,6.1359,330000,-0.117505,temp,temp2
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700,1.061560,temp,temp2
...,...,...,...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000,-0.153826,temp,temp2
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200,0.246395,temp,temp2
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000,-0.612814,temp,temp2
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500,-2.012305,temp,temp2
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001,0.335743,temp,temp2

## Remover columnas con ```del```

Puedes usar la notación _del df[col_name]_ para eliminar una columna directamente de un DataFrame:

In [43]:
#el dataframe original no ha sido alterado
#aun contiene las columnas temporales
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random,temp,temp2
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454,temp,temp2
1,-118.30,34.26,43,1510,200,809,277,3.5990,176500,0.970595,temp,temp2
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649,temp,temp2
3,-118.36,33.82,28,67,15,49,11,6.1359,330000,-0.117505,temp,temp2
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700,1.061560,temp,temp2
...,...,...,...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000,-0.153826,temp,temp2
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200,0.246395,temp,temp2
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000,-0.612814,temp,temp2
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500,-2.012305,temp,temp2
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001,0.335743,temp,temp2

In [44]:
#eliminamos la nueva columna temp con del directamente en el df
del cali_housing["temp"]
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random,temp2
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454,temp2
1,-118.30,34.26,43,1510,200,809,277,3.5990,176500,0.970595,temp2
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649,temp2
3,-118.36,33.82,28,67,15,49,11,6.1359,330000,-0.117505,temp2
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700,1.061560,temp2
...,...,...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000,-0.153826,temp2
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200,0.246395,temp2
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000,-0.612814,temp2
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500,-2.012305,temp2
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001,0.335743,temp2

In [45]:
#del elimina una columna a la vez
# llamemos del una segunda vez para eliminar temp2
del cali_housing["temp2"]
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454
1,-118.30,34.26,43,1510,200,809,277,3.5990,176500,0.970595
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649
3,-118.36,33.82,28,67,15,49,11,6.1359,330000,-0.117505
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700,1.061560
...,...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000,-0.153826
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200,0.246395
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000,-0.612814
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500,-2.012305
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001,0.335743

# Datos faltantes

En Pandas, los [```valores faltantes```](https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html) son representado con el valor NaN (de Not a Number). Cuando existen valores faltantes, muchas veces es necesario eliminarlar las entradas que los contienen o reemplazarlos por valores antes de empezar a trabajar con los datos. Pandas provee algunos métodos para realizar este tipo de tareas.

In [46]:
#creando un dataframe con datos faltantes
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['A', 'B', 'C'])
df['D'] = df['A'] > 0
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

          A         B         C      D
a -0.835952  0.037932 -0.065870  False
b       NaN       NaN       NaN    NaN
c -0.005909  1.182065 -1.176228  False
d       NaN       NaN       NaN    NaN
e -0.326995 -0.006182 -0.149639  False
f -0.400486  0.253933 -1.145395  False
g       NaN       NaN       NaN    NaN
h -1.035075  0.050081 -0.222445  False

## df.isna()

El método [```df.isna()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isna.html) funciona para conocer si el objeto contiene valores faltantes. Regresa un objeto con elementos booleanos que indican la existencia de datos faltantes.

In [47]:
df.isna()

       A      B      C      D
a  False  False  False  False
b   True   True   True   True
c  False  False  False  False
d   True   True   True   True
e  False  False  False  False
f  False  False  False  False
g   True   True   True   True
h  False  False  False  False

## df.dropna()

El método [```dropna()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html) permite eliminar del DataFrame las filas o columnas que contienen uno o más elementos NaN.

Los principales parámetros de dropna():

```
axis : {0 o 'index', 1 o 'columns'}, por defecto 0
        Determina si elimina filas o columnas que contienen
        valores faltantes.
    
how : {'any', 'all'}, por defecto 'any'
    Determina si se elimina la fila o columna cuando contiene al menos un valor faltante o solo si todos sus valores son faltantes.

    * 'any' : Si hay un valor faltante, elimina la fila o columna.
    * 'all' : Si todos los valores son faltantes, elimina la fila o columna.
    
thresh : int, opcional
    Requirir al menos ese número de valores faltantes para eliminar la fila o columna.
```

In [48]:
df.dropna(axis=0, how='any')

          A         B         C      D
a -0.835952  0.037932 -0.065870  False
c -0.005909  1.182065 -1.176228  False
e -0.326995 -0.006182 -0.149639  False
f -0.400486  0.253933 -1.145395  False
h -1.035075  0.050081 -0.222445  False

In [49]:
#insertando un nuevo nan
df.iat[0, 0] = np.nan

Usando ```all``` con ```axis=0``` elimina filas donde todos los elementos faltan:

In [50]:
df.dropna(axis = 0, how='all')

          A         B         C      D
a       NaN  0.037932 -0.065870  False
c -0.005909  1.182065 -1.176228  False
e -0.326995 -0.006182 -0.149639  False
f -0.400486  0.253933 -1.145395  False
h -1.035075  0.050081 -0.222445  False

Usando ```any``` con axis=0, elimina las filas con uno o más faltantes:

In [51]:
df.dropna(axis=0, how="any")

          A         B         C      D
c -0.005909  1.182065 -1.176228  False
e -0.326995 -0.006182 -0.149639  False
f -0.400486  0.253933 -1.145395  False
h -1.035075  0.050081 -0.222445  False

Agregamos una nueva columna con todos los elementos ```NaN```:

In [52]:
df["empty_col"] = np.nan
df

          A         B         C      D  empty_col
a       NaN  0.037932 -0.065870  False        NaN
b       NaN       NaN       NaN    NaN        NaN
c -0.005909  1.182065 -1.176228  False        NaN
d       NaN       NaN       NaN    NaN        NaN
e -0.326995 -0.006182 -0.149639  False        NaN
f -0.400486  0.253933 -1.145395  False        NaN
g       NaN       NaN       NaN    NaN        NaN
h -1.035075  0.050081 -0.222445  False        NaN

Eliminando la columna con ```axis=1``` y ```how=all```:

In [53]:
# La columna con solo ```NaN``` sera eliminada por completo
df.dropna(axis=1, how="all")

          A         B         C      D
a       NaN  0.037932 -0.065870  False
b       NaN       NaN       NaN    NaN
c -0.005909  1.182065 -1.176228  False
d       NaN       NaN       NaN    NaN
e -0.326995 -0.006182 -0.149639  False
f -0.400486  0.253933 -1.145395  False
g       NaN       NaN       NaN    NaN
h -1.035075  0.050081 -0.222445  False

## df.fillna()

El método [```df.fillna()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html) permite reemplazar los valores faltantes en un DataFrame por otro valor.

Los principales parámetros de fillna():

```
value : escalar, diccionario, Series, o un DataFrame
    El valor utilizado para reemplazar los faltantes.
    Si es un diccionario, una serie o un dataframe, entonces
    se utiliza el valor asociado a la clave, indice o columna asociada.

method : {'backfill', 'bfill', 'pad', 'ffill', None}, por defecto None
    El método utilizado para rellenar los espacios vacios.
    * pad / ffill: usa el ultimo valor valido para rellenar 
    hacia adelante hasta el siguiente valor valido.
    * backfill / bfill: utilizar la siguiente observacion 
    valida para rellenar.

axis : {0 or 'index', 1 or 'columns'}
```

Reemplazar todos los faltantes por un escalar:

In [54]:
# fillna con escalar
df.fillna(0.0)

          A         B         C      D  empty_col
a  0.000000  0.037932 -0.065870  False        0.0
b  0.000000  0.000000  0.000000    0.0        0.0
c -0.005909  1.182065 -1.176228  False        0.0
d  0.000000  0.000000  0.000000    0.0        0.0
e -0.326995 -0.006182 -0.149639  False        0.0
f -0.400486  0.253933 -1.145395  False        0.0
g  0.000000  0.000000  0.000000    0.0        0.0
h -1.035075  0.050081 -0.222445  False        0.0

Reemplazar usando un dicccionario para las columnas de un Dataframe:

In [55]:
# usando un diccionario para reemplazar con un valor diferente cada columna
df.fillna({'A': 0.0, 'B': 0.0, 'C': 0.0, 'D': False})

          A         B         C      D  empty_col
a  0.000000  0.037932 -0.065870  False        NaN
b  0.000000  0.000000  0.000000  False        NaN
c -0.005909  1.182065 -1.176228  False        NaN
d  0.000000  0.000000  0.000000  False        NaN
e -0.326995 -0.006182 -0.149639  False        NaN
f -0.400486  0.253933 -1.145395  False        NaN
g  0.000000  0.000000  0.000000  False        NaN
h -1.035075  0.050081 -0.222445  False        NaN

Con un diccionario para los índices de una Serie:

In [56]:
df["A"].fillna({'a':0.0, 'b':1.0, 'c':2.0})

a    0.000000
b    1.000000
c   -0.005909
d         NaN
e   -0.326995
f   -0.400486
g         NaN
h   -1.035075
Name: A, dtype: float64

Forward Fill:

```axis = 0``` por defecto (por columnas, siguiendo el index):

In [57]:
df.fillna(method='ffill',)

          A         B         C      D  empty_col
a       NaN  0.037932 -0.065870  False        NaN
b       NaN  0.037932 -0.065870  False        NaN
c -0.005909  1.182065 -1.176228  False        NaN
d -0.005909  1.182065 -1.176228  False        NaN
e -0.326995 -0.006182 -0.149639  False        NaN
f -0.400486  0.253933 -1.145395  False        NaN
g -0.400486  0.253933 -1.145395  False        NaN
h -1.035075  0.050081 -0.222445  False        NaN

```axis=1``` (por filas, todas las columnas):

In [58]:
# un nuevo elemento faltante en la fila c columnas C
df.iat[2, 2] = np.NaN
df

          A         B         C      D  empty_col
a       NaN  0.037932 -0.065870  False        NaN
b       NaN       NaN       NaN    NaN        NaN
c -0.005909  1.182065       NaN  False        NaN
d       NaN       NaN       NaN    NaN        NaN
e -0.326995 -0.006182 -0.149639  False        NaN
f -0.400486  0.253933 -1.145395  False        NaN
g       NaN       NaN       NaN    NaN        NaN
h -1.035075  0.050081 -0.222445  False        NaN

In [59]:
# rellenando de izq a der por filas
df.fillna(method='ffill', axis=1)

          A         B         C      D empty_col
a       NaN  0.037932  -0.06587  False     False
b       NaN       NaN       NaN    NaN       NaN
c -0.005909  1.182065  1.182065  False     False
d       NaN       NaN       NaN    NaN       NaN
e -0.326995 -0.006182 -0.149639  False     False
f -0.400486  0.253933 -1.145395  False     False
g       NaN       NaN       NaN    NaN       NaN
h -1.035075  0.050081 -0.222445  False     False

Back Fill:

```axis=0``` por defecto (por columnas):

In [60]:
# rellena de abajo hacia arriba por columnas
df.fillna(method='bfill')

          A         B         C      D  empty_col
a -0.005909  0.037932 -0.065870  False        NaN
b -0.005909  1.182065 -0.149639  False        NaN
c -0.005909  1.182065 -0.149639  False        NaN
d -0.326995 -0.006182 -0.149639  False        NaN
e -0.326995 -0.006182 -0.149639  False        NaN
f -0.400486  0.253933 -1.145395  False        NaN
g -1.035075  0.050081 -0.222445  False        NaN
h -1.035075  0.050081 -0.222445  False        NaN

```axis=1``` (por filas):

In [61]:
# rellena de der a izq por filas
df.fillna(method='bfill', axis=1)

          A         B         C      D empty_col
a  0.037932  0.037932  -0.06587  False       NaN
b       NaN       NaN       NaN    NaN       NaN
c -0.005909  1.182065     False  False       NaN
d       NaN       NaN       NaN    NaN       NaN
e -0.326995 -0.006182 -0.149639  False       NaN
f -0.400486  0.253933 -1.145395  False       NaN
g       NaN       NaN       NaN    NaN       NaN
h -1.035075  0.050081 -0.222445  False       NaN

# Métodos Utilitarios

* [```df.copy()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.copy.html)
* [```df.sort_values([ascending=True|False])```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html)
* [```df.sort_index([ascending=True|False])```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_index.html#pandas.DataFrame.sort_index)

## df.copy()

Crea una copia profunda (por defecto) del objeto:

In [62]:
df = cali_housing.copy()
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700,2.042454
1,-118.30,34.26,43,1510,200,809,277,3.5990,176500,0.970595
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500,-0.054649
3,-118.36,33.82,28,67,15,49,11,6.1359,330000,-0.117505
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700,1.061560

Ahora modificar ```df``` no afectará a ```cali_housing``` y viceversa.

## df.sort_values()

Ordenar usando los valores en el Dataframe:

In [63]:
df.sort_values("housing_median_age")

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
842,-117.95,35.08,1,83,15,32,15,4.8750,141700,-0.319785
1115,-116.95,33.86,1,6,2,8,2,1.6250,55000,1.021924
2117,-117.51,34.16,2,718,98,119,50,4.1000,315000,0.988860
2429,-117.20,33.58,2,30450,5033,9419,3197,4.5936,174300,2.008443
495,-122.29,37.82,2,158,43,94,57,2.5625,60000,0.434494
...,...,...,...,...,...,...,...,...,...,...
717,-122.27,37.86,52,2307,583,1127,548,1.8447,198200,-0.271852
708,-118.21,33.97,52,4220,908,3731,892,3.1901,167600,-0.664984
1826,-122.04,37.00,52,3365,644,796,333,2.9712,116600,-2.100830
754,-121.49,38.56,52,1777,368,624,350,3.6729,137800,0.259895
1499,-122.21,37.79,52,762,190,600,195,3.0893,125000,1.051605

Ordenar usando más de una columna:

In [64]:
df.sort_values(["housing_median_age", "households"])

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
1115,-116.95,33.86,1,6,2,8,2,1.6250,55000,1.021924
842,-117.95,35.08,1,83,15,32,15,4.8750,141700,-0.319785
1050,-121.96,37.74,2,200,20,25,9,15.0001,350000,0.752579
2117,-117.51,34.16,2,718,98,119,50,4.1000,315000,0.988860
495,-122.29,37.82,2,158,43,94,57,2.5625,60000,0.434494
...,...,...,...,...,...,...,...,...,...,...
26,-122.42,37.76,52,3587,1030,2259,979,2.5403,250000,-2.169187
2950,-122.42,37.79,52,3364,1100,2112,1045,2.1343,400000,-2.345066
1780,-122.42,37.76,52,4407,1192,2280,1076,3.3937,270000,0.336357
1346,-122.44,37.77,52,5604,1268,2023,1196,4.4085,400000,-1.367883
1510,-122.43,37.79,52,6186,1566,2065,1374,5.8543,500001,0.147375

## df.sort_index()

Ordenar usando los índices del Dataframe/Series:

In [65]:
#una muestra aleatoria
df = cali_housing.sample(5)
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
895,-118.37,34.08,52,2946,695,1258,650,3.9783,374100,0.515964
127,-122.02,37.96,25,2615,368,935,366,6.6727,305100,2.167147
142,-117.98,34.10,22,5661,1209,5389,1178,3.7727,159700,-0.111401
301,-118.26,33.94,41,1510,410,1408,389,1.6500,94200,-0.491561
2371,-117.08,32.57,18,2203,544,1943,497,2.2500,103200,-1.923141

In [66]:
# ordenar por index
df.sort_index()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
127,-122.02,37.96,25,2615,368,935,366,6.6727,305100,2.167147
142,-117.98,34.10,22,5661,1209,5389,1178,3.7727,159700,-0.111401
301,-118.26,33.94,41,1510,410,1408,389,1.6500,94200,-0.491561
895,-118.37,34.08,52,2946,695,1258,650,3.9783,374100,0.515964
2371,-117.08,32.57,18,2203,544,1943,497,2.2500,103200,-1.923141

Para un objeto Series:

In [67]:
s = cali_housing["total_rooms"].sample(5)
s

677     3367
2358    4221
1709    1086
1373    1168
2322    1320
Name: total_rooms, dtype: int64

In [68]:
s.sort_index()

677     3367
1373    1168
1709    1086
2322    1320
2358    4221
Name: total_rooms, dtype: int64

# Métodos matemáticos

[Operaciones binarias](https://pandas.pydata.org/docs/reference/frame.html#binary-operator-functions):

* [```add(other)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.add.html), suma elemento por elemento un DataFrames/Series y other.
* [```sub(other)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sub.html#pandas.DataFrame.sub), resta elemento por elemento un DataFrames/Series y other.
* [```mul(other)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.mul.html#pandas.DataFrame.mul), multiplicación elemento por elemento de un DataFrames/Series por other.
* [```div(other)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.div.html#pandas.DataFrame.div), divide elemento por elemento un DataFrames/Series entre other.
* [```mod(other)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.mod.html#pandas.DataFrame.mod), calcula el módulo de un DataFrame/Series usando other.
* [```pow(other)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pow.html#pandas.DataFrame.pow), calcula el exponente elemento por elemento de un DataFrame/Series elevado a la potencia de other.
* [```dot(other)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dot.html), producto punto o de matrices entre dos Series/DataFrames respectivamente.

_Las operaciones binarias pueden utilizar broadcasting, entonces pueden recibir escalares, Dataframes o Series._


[Operaciones estadísticas](https://pandas.pydata.org/docs/reference/frame.html#computations-descriptive-stats):
* [```abs()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.abs.html), valor absoluto de los elementos.
* [```count(axis)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.count.html), cuenta el número de elementos no-nulos en las filas o columnas. 
* [```max(axis)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.max.html), retorna el valor máximo encontrado por filas o columnas.
* [```min(axis)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.min.html#pandas.DataFrame.min), retorna el valor mínimo encontrado por filas o columnas.
* [```mean(axis)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.mean.html), retorna la media de los elementos por filas o columnas.
* [```median(axis)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.median.html), retorna la mediana de los elementos de las filas o columnas.
* [```sum(axis)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sum.html), retorna la suma de todos los elementos de las filas o columnas.
* [```std(axis)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.std.html), retorna la desviación estándar de las filas o columnas.
* [```var(axis)```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.var.html),retorna la varianza de las filas o columnas.

## Operaciones binarias

In [69]:
#creamos un dataframe para ejemplificar las funciones
df = pd.DataFrame({'angles': [0, 3, 4], 'degrees': [360, 180, 360]}, index=['circle', 'triangle', 'rectangle'])
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

### add(), sub(), mul() y div()

In [70]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

o

In [71]:
df + 1

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [72]:
df.mul(2)

           angles  degrees
circle          0      720
triangle        6      360
rectangle       8      720

o

In [73]:
df * 2

           angles  degrees
circle          0      720
triangle        6      360
rectangle       8      720

In [74]:
df.div(2)

           angles  degrees
circle        0.0    180.0
triangle      1.5     90.0
rectangle     2.0    180.0

o

In [75]:
df / 2

           angles  degrees
circle        0.0    180.0
triangle      1.5     90.0
rectangle     2.0    180.0

### mod() y pow()

In [76]:
df.mod(2)

           angles  degrees
circle          0        0
triangle        1        0
rectangle       0        0

o

In [77]:
df % 2

           angles  degrees
circle          0        0
triangle        1        0
rectangle       0        0

In [78]:
df.pow(3)

           angles   degrees
circle          0  46656000
triangle       27   5832000
rectangle      64  46656000

o

In [79]:
df ** 3

           angles   degrees
circle          0  46656000
triangle       27   5832000
rectangle      64  46656000

### dot()

In [80]:
#un nuevo dataframe para ejemplificar dot
df = pd.DataFrame([[0, 1, -2, -1], [1, 1, 1, 1]])
df

   0  1  2  3
0  0  1 -2 -1
1  1  1  1  1

In [81]:
#dot usando una serie
s = pd.Series([1, 1, 2, 1])
df.dot(s)

0   -4
1    5
dtype: int64

In [82]:
#dot de dos matrices
other = pd.DataFrame([[0, 1], [1, 2], [-1, -1], [2, 0]])
df.dot(other)

   0  1
0  1  4
1  2  2

*Nota: Las operaciones binarias pueden aplicarse usando escalares, series u otros dataframes.*

## Operaciones estadísticas

### abs()

In [83]:
#un df con valores negativos
df = pd.DataFrame({'a': [4, -5, -6, 7], 'b': [-10, 20, 30, -40], 'c': [100, 50, -30, -50]})
df

   a   b    c
0  4 -10  100
1 -5  20   50
2 -6  30  -30
3  7 -40  -50

In [84]:
df.abs()

   a   b    c
0  4  10  100
1  5  20   50
2  6  30   30
3  7  40   50

### count()

In [85]:
#un dataframe con valores no-nulos y nuelos
df = pd.DataFrame({"Person":["John", "Myla", "Lewis", "John", "Myla"],
                    "Age": [24., np.nan, 21., 33, 26],
                    "Single": [False, True, True, np.nan, np.nan]})
df

  Person   Age Single
0   John  24.0  False
1   Myla   NaN   True
2  Lewis  21.0   True
3   John  33.0    NaN
4   Myla  26.0    NaN

Count para cada columna (por defecto ```axis=0```):

In [86]:
df.count()

Person    5
Age       4
Single    3
dtype: int64

Count para cada fila (```axis=1```)

In [87]:
df.count(axis=1)

0    3
1    2
2    3
3    2
4    2
dtype: int64

### max() y min()

In [88]:
#creamos un dataframe para ejemplificar las funciones
df = pd.DataFrame({'angles': [0, 3, 4], 'degrees': [360, 180, 360]}, index=['circle', 'triangle', 'rectangle'])
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

Para cada columna (por defecto ```axis=0```):

In [89]:
df.max(axis=0)

angles       4
degrees    360
dtype: int64

In [90]:
# axis = 0 por defecto
df.min()

angles       0
degrees    180
dtype: int64

Para cada fila (```axis=1```):

In [91]:
df.max(axis=1)

circle       360
triangle     180
rectangle    360
dtype: int64

In [92]:
df.min(axis=1)

circle       0
triangle     3
rectangle    4
dtype: int64

### mean() y median()

Para cada columna (por defecto ```axis=0```)

In [93]:
df.mean()

angles       2.333333
degrees    300.000000
dtype: float64

In [94]:
df.median()

angles       3.0
degrees    360.0
dtype: float64

Para cada fila (```axis=1```):

In [95]:
df.mean(axis=1)

circle       180.0
triangle      91.5
rectangle    182.0
dtype: float64

In [96]:
df.median(axis=1)

circle       180.0
triangle      91.5
rectangle    182.0
dtype: float64

### sum()

Para cada columna columna (por defecto ```axis=0```):

In [97]:
df.sum()

angles       7
degrees    900
dtype: int64

Para cada fila (```axis=1```):

In [98]:
df.sum(axis=1)

circle       360
triangle     183
rectangle    364
dtype: int64

### std() y var()

Para cada columna (por defecto ```axis=0```):

In [99]:
df.std()

angles       2.081666
degrees    103.923048
dtype: float64

In [100]:
df.var()

angles         4.333333
degrees    10800.000000
dtype: float64

Para cada fila (```axis=1```):

In [101]:
df.std(axis=1)

circle       254.558441
triangle     125.157900
rectangle    251.730014
dtype: float64

In [102]:
df.var(axis=1)

circle       64800.0
triangle     15664.5
rectangle    63368.0
dtype: float64

# Aplicando funciones propias

## apply()

[```df.apply()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html) recibe una función y la aplica a todas las filas o columnas según el axis indicado.

```axis=0``` aplica la función por columnas:

In [103]:
f = lambda x: (x - x.mean())/x.var()

#aplica la funcion a todas las filas, columna por columna
cali_housing.apply(f, axis=0)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
0,-0.618327,0.382452,-0.011706,0.000277,0.000759,0.000126,0.000869,0.814497,0.000011,2.089740
1,0.323938,-0.303250,0.089792,-0.000234,-0.001909,-0.000559,-0.001594,-0.060558,-0.000002,0.988944
2,0.447061,-0.409082,-0.011706,0.000213,-0.000133,0.000076,0.000038,0.577495,0.000005,-0.063977
3,0.308862,-0.400263,-0.005362,-0.000545,-0.002980,-0.001275,-0.003586,0.677082,0.000010,-0.128530
4,-0.020303,0.153150,-0.062455,-0.000292,-0.001655,-0.000521,-0.001894,-0.252898,-0.000010,1.082366
...,...,...,...,...,...,...,...,...,...,...
2995,-0.068044,-0.267973,-0.037081,-0.000247,0.000649,-0.000136,0.000877,-0.764207,0.000001,-0.165832
2996,0.364142,-0.347347,-0.011706,0.000572,0.003195,0.001971,0.004090,-0.121153,0.000002,0.245193
2997,-0.027841,0.146535,-0.119548,-0.000354,-0.001904,-0.000668,-0.002021,-0.441314,-0.000011,-0.637210
2998,0.620438,-0.338528,0.070761,-0.000539,-0.002986,-0.001278,-0.003564,-0.155987,-0.000003,-2.074483
2999,-0.010252,-0.267973,0.083449,-0.000180,-0.001545,-0.000612,-0.001722,1.382155,0.000023,0.336954

```axis = 1``` aplica la función por filas:

In [104]:
#aplica la funcion a todas las filas
cali_housing.apply(f, axis=1)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
0,-0.000003,-0.000003,-0.000003,-0.000003,-0.000003,-0.000003,-0.000003,-0.000003,0.000026,-0.000003
1,-0.000006,-0.000006,-0.000006,-0.000005,-0.000006,-0.000006,-0.000006,-0.000006,0.000051,-0.000006
2,-0.000004,-0.000004,-0.000004,-0.000003,-0.000004,-0.000004,-0.000004,-0.000004,0.000033,-0.000004
3,-0.000003,-0.000003,-0.000003,-0.000003,-0.000003,-0.000003,-0.000003,-0.000003,0.000027,-0.000003
4,-0.000013,-0.000013,-0.000013,-0.000011,-0.000012,-0.000011,-0.000012,-0.000013,0.000111,-0.000013
...,...,...,...,...,...,...,...,...,...,...
2995,-0.000005,-0.000005,-0.000005,-0.000004,-0.000004,-0.000004,-0.000004,-0.000005,0.000040,-0.000005
2996,-0.000004,-0.000004,-0.000004,-0.000004,-0.000004,-0.000004,-0.000004,-0.000004,0.000038,-0.000004
2997,-0.000017,-0.000017,-0.000017,-0.000014,-0.000016,-0.000015,-0.000016,-0.000017,0.000146,-0.000017
2998,-0.000006,-0.000006,-0.000006,-0.000006,-0.000006,-0.000006,-0.000006,-0.000006,0.000055,-0.000006
2999,-0.000002,-0.000002,-0.000002,-0.000002,-0.000002,-0.000002,-0.000002,-0.000002,0.000018,-0.000002

## applymap()

[```df.applymap()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.applymap.html#pandas.DataFrame.applymap) aplica una función elemento por elemento al objeto de Pandas.

In [105]:
f = lambda x: round(x)

#aplica la funcion a todos los elementos
cali_housing.applymap(f)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,random
0,-122,37,27,3885,661,1537,606,7,344700,2
1,-118,34,43,1510,200,809,277,4,176500,1
2,-118,34,27,3589,507,1484,495,6,270500,0
3,-118,34,28,67,15,49,11,6,330000,0
4,-120,36,19,1241,244,850,237,3,81700,1
...,...,...,...,...,...,...,...,...,...,...
2995,-120,34,23,1450,642,1258,607,1,225000,0
2996,-118,34,27,5257,1082,3496,1036,3,237200,0
2997,-120,36,10,956,201,693,220,2,62000,-1
2998,-117,34,40,96,14,46,14,3,162500,-2
2999,-120,34,42,1765,263,753,260,9,500001,0

# Operaciones en columnas

Puedes realizar operaciones directamente en las columnas de un DataFrame para obtener resultados como una Serie o para crear nuevas columnas.  Por ejemplo:

* Relizar operaciones binarias entre columnas. (suma, resta, multiplicación, etc.).
* Aplicar métodos estadísticos en las columnas. (sum(), mean(), var(), etc.).
* Una mezcla de operaciones binarias y métodos.

In [106]:
#creando un dataframe
df = pd.DataFrame({"A":[1, 2, 3], "B":[2, 2, 2]})
df

   A  B
0  1  2
1  2  2
2  3  2

In [107]:
#operaciones entre columna regresan una serie
df["A"] * df["B"]

0    2
1    4
2    6
dtype: int64

In [108]:
#generar una nueva columna desde una operacion
df["A^B"] = df["A"].pow(df["B"])
df

   A  B  A^B
0  1  2    1
1  2  2    4
2  3  2    9

In [109]:
#aplicar un metodo estadistico a una columna genera un valor
df["A"].sum()

6

In [110]:
#generando una nueva columna con la suma de las filas
df["suma"] = df.sum(axis=1)
df

   A  B  A^B  suma
0  1  2    1     4
1  2  2    4     8
2  3  2    9    14

# Funciones por grupos y agregación

## aggregate()/agg()

La agregación de datos es una transformación que produce un valor escalar a partir de un arreglo, por ejemplo, las funciones/métodos "sum" y "mean". Los métodos [```aggregate()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html) y su alias [```agg()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html) permiten aplicar una o más funciones de agregación a los objetos de Pandas. 

Los parámetros principales son:



```
func : funcion, str, list o dict
  La funcion o funciones utilizadas para la agregacion de los datos.

  Las combinaciones aceptadas:

  * funcion
  * cadena con el nombre de la funcion
  * lista de funciones y/o nombre de las funciones (ej, [np.sum, 'mean'])
  * diccionario de etiquetas del axis que mapean a:
      - las funciones.
      - nombre de funciones.
      - lista de funciones.

axis : {0 or ‘index’, 1 or ‘columns’}, por defecto 0
  Si axis=0 o ‘index’: aplica la funcion sobre todas las filas por cada columna.
  Si axis=1 o ‘columns’: aplica la funcion sobre cada fila para todas las columnas.
```

In [111]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9]],
                  columns=['A', 'B', 'C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

Por columna (por defecto axis=0):

In [112]:
#funcion de agregacion para calcular varios estadisticos a las columnas
df.agg(["min", "max"])

     A  B  C
min  1  2  3
max  7  8  9

Por filas (axis=1):

In [113]:
#funcion de agregacion para calcular varios estadisticos a las filas
df.agg(["min", "max"], axis=1)

   min  max
0    1    3
1    4    6
2    7    9

Usando un diccionario como parámetro:

In [114]:
df.agg({"A": np.min, "B": np.max, "C": [np.mean, np.std]})

        A    B    C
amin  1.0  NaN  NaN
amax  NaN  8.0  NaN
mean  NaN  NaN  6.0
std   NaN  NaN  3.0

## groupby()

El método [```df.groupby()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html) permite generar grupos de datos usando una o más columnas para aplicar funciones de transformación o de agregación. 

Groupby es útil para contestar preguntas tipo: ¿cuál es la media de altura en hombres y mujeres? o ¿cúal es estado con menor población para cada país?

In [116]:
df = pd.DataFrame({"Sexo": ["M", "F", "F", "M", "F"], "Altura": [1.68, 1.55, 1.75, 1.82, 1.65], "Peso": [70, 50, 68, 72, 60]})
df

  Sexo  Altura  Peso
0    M    1.68    70
1    F    1.55    50
2    F    1.75    68
3    M    1.82    72
4    F    1.65    60

In [117]:
#generar un dataframe argupado por una columna
df.groupby("Sexo")

groupby() por si solo no resulta en la salida esperada.

Hay que aplicar una función:

In [118]:
#la media de las columnas
df.groupby("Sexo").mean()

      Altura       Peso
Sexo
F       1.65  59.333333
M       1.75  71.000000

In [119]:
#seleccionando una sola columna para la agregacion
df.groupby("Sexo")["Altura"].mean()

Sexo
F    1.65
M    1.75
Name: Altura, dtype: float64

**groupby() y agg()**

Puedes mezclar groupby() con agg() para aplicar más de una función.

In [120]:
df.groupby("Sexo").agg(["mean", "std"])

     Altura                 Peso
       mean       std       mean       std
Sexo
F      1.65  0.100000  59.333333  9.018500
M      1.75  0.098995  71.000000  1.414214

**Agrupando con más de una columna**

In [121]:
#agregar una nueva columna al df
df["Estado"] = ["Morelos", "DF", "Morelos", "DF", "DF"]
df

  Sexo  Altura  Peso   Estado
0    M    1.68    70  Morelos
1    F    1.55    50       DF
2    F    1.75    68  Morelos
3    M    1.82    72       DF
4    F    1.65    60       DF

In [122]:
#usando mas de una clave para la agrupacion
df.groupby(["Sexo", "Estado"]).agg("mean")

              Altura  Peso
Sexo Estado
F    DF         1.60  55.0
     Morelos    1.75  68.0
M    DF         1.82  72.0
     Morelos    1.68  70.0

# Combinar Dataframes

## append()

[```df.append()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.append.html) concatena las filas de un DataFrame a otro usando las columnas que coinciden. Columnas que no coinciden son agregadas al DataFrame resultante.

In [123]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=["A", "B"])
df

   A  B
0  1  2
1  3  4

In [124]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=["A", "B"])
df2

   A  B
0  5  6
1  7  8

In [125]:
df.append(df2)

   A  B
0  1  2
1  3  4
0  5  6
1  7  8

## merge() y join()

[```df.merge()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html) y [```df.join()```](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html) permiten joins de dataframes al estilo SQL.

Si no conoces SQL visita este sitio para darte una idea de los tipos de joins disponibles: https://www.w3schools.com/sql/sql_join.asp

![wikipedia](https://upload.wikimedia.org/wikipedia/commons/c/c9/Joins_del_SQL.svg)

**merge()** 

Permite la unión de Dataframes o Series al estilo base de datos.

Parámetros principales:


```
right : DataFrame o  Series
  Objeto con quien realizar merge()

how:{‘left’, ‘right’, ‘outer’, ‘inner’}, Por defecto ‘inner’
  Type of merge to be performed.

  left: similar a un left outer join de SQL.
  right: similar a un  right outer join SQL.
  outer:  similar a un full outer join SQL.
  inner: similar a un inner join de SQL.

on : etiqueta o lista de etiquetas
  Columnas o indices para unir. Deben estar en ambos DataFrames.

left_on : etiqueta, lista de etiquetas
  Columnas o indices para unir del DataFrame de la izquierda.

right_on : etiqueta, lista de etiquetas
  Columnas o indices para unir del DataFrame de la derecha.
```

In [126]:
# df1 tiene un elemento unico u1 que df2 no tiene
df1 = pd.DataFrame({'key': ['a', 'b', 'u1', 'a'], 'value': [1, 2, 3, 5]})
df1

  key  value
0   a      1
1   b      2
2  u1      3
3   a      5

In [127]:
# df2 tiene un elemento unico u2 que no df1 no tiene
df2 = pd.DataFrame({'key': ['a', 'b', 'u2', 'a'], 'value': [5, 6, 7, 8]})
df2

  key  value
0   a      5
1   b      6
2  u2      7
3   a      8

Inner

```
df1.merge(df2, how="inner", on="key")
```

Mantiene las llaves ```key``` que coinciden en ambos dataframes.


| df1   || coincide en ```key``` de df2|
|---||----|
| (a, 1) || (a, 5) y (a, 8) |
| (a, 5) || (a, 5) y (a, 8) |
| (b, 2) || (b, 6) |

In [128]:
df1.merge(df2, how="inner", on="key")

  key  value_x  value_y
0   a        1        5
1   a        1        8
2   a        5        5
3   a        5        8
4   b        2        6

Outer

Mantiene las filas de ambos Dataframes, sin importar si existe o no existe un mapeo entre las llaves ```key```.

| df1   || df2|
|---||----|
| (a, 1) || (a, 5) y (a, 8) |
| (a, 5) || (a, 5) y (a, 8) |
| (b, 2) || (b, 6) |
| (u1, 3)|| NaN |
| NaN || (u2, 7)|

In [129]:
df1.merge(df2, how="outer", on="key")

  key  value_x  value_y
0   a      1.0      5.0
1   a      1.0      8.0
2   a      5.0      5.0
3   a      5.0      8.0
4   b      2.0      6.0
5  u1      3.0      NaN
6  u2      NaN      7.0

Left

Mantiene todas las filas del Dataframe de la izquierda y en las que existe un match en ```key``` en el Dataframe de la derecha.

| df1 (left)   || df2 (right)|
|---||----|
| (a, 1) || (a, 5) y (a, 8) |
| (a, 5) || (a, 5) y (a, 8) |
| (b, 2) || (b, 6) |
| (u1, 3)|| NaN |

In [130]:
df1.merge(df2, how="left", on="key")

  key  value_x  value_y
0   a        1      5.0
1   a        1      8.0
2   b        2      6.0
3  u1        3      NaN
4   a        5      5.0
5   a        5      8.0

Right

Mantiene todas las filas del Dataframe de la derecha y en las que existe un match en ```key``` en el Dataframe de la izquierda.

| df1 (left)   || df2 (right)|
|---||----|
| (a, 1) || (a, 5) y (a, 8) |
| (a, 5) || (a, 5) y (a, 8) |
| (b, 2) || (b, 6) |
| NaN || (u2, 7) |

In [131]:
df1.merge(df2, how="right", on="key")

  key  value_x  value_y
0   a      1.0        5
1   a      5.0        5
2   b      2.0        6
3  u2      NaN        7
4   a      1.0        8
5   a      5.0        8

**join()**

Permite unir las columnas de uno o más objetos usando su índice o usando una columna como clave.


Parámetros:
```
other : DataFrame, Series, o lista de DataFrames

on : str o lista de str, opcional (por defecto usa los indices)

how:{‘left’, ‘right’, ‘outer’, ‘inner’}, Por defecto ‘inner’
  Type of merge to be performed.

  left: usar el indice del DataFrame que llama al metodo.
  right: usar el indice de other.
  outer:  union de los indices.
  inner: interseccion de los indices.

lsuffix : str, por defecto ‘’
  sufijo a utilizar del dataframe izq para la columnas sobrelapadas.

rsuffix : str, default ‘’
  sufijo a utilizar del dataframe der para la columnas sobrelapadas.
```

In [132]:
df1 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo'], 'value': [1, 2, 3, 5]}).set_index("key")
df1

     value
key
foo      1
bar      2
baz      3
foo      5

In [133]:
df2 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo'], 'value': [5, 6, 7, 8]}).set_index("key")
df2

     value
key
foo      5
bar      6
baz      7
foo      8

In [134]:
df1.join(df2, lsuffix="_l", rsuffix="_r")

     value_l  value_r
key
bar        2        6
baz        3        7
foo        1        5
foo        1        8
foo        5        5
foo        5        8

# Cadenas

Muchas de los métodos/funciones de Python para variables string, tienen un [método equivalente](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-data-types) en los objetos Series y DataFrames de Pandas.

Métodos principales para cadenas:

* str.cat(other, sep), concatenta sep y other a cada str en el objeto.
* str.split(str), divide la cadena usando el separador especificado.
* str.replace(patt, repl), reemplaza en la cadena patt por repl.
* str.lower() y str.upper(), para convertir cadenas a minúsculas o mayúsculas.
* str.len(), calcula la longitud de la cadena.
* str.count(str), cuenta el número de apariciones de str en la cadena.
* str.strip(str), elimina str al inicio y final de la cadena.

Visita la documentación para la lista completa de [métodos para cadenas de texto de Pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#method-summary).

In [135]:
s1 = pd.Series(["A", "B", "C"])
s1

0    A
1    B
2    C
dtype: object

In [136]:
s2 = pd.Series(["1", "2", "3"])
s2

0    1
1    2
2    3
dtype: object

In [137]:
#concatenando s1 y s2 generando s3
s3 = s1.str.cat(s2, sep="-")
s3

0    A-1
1    B-2
2    C-3
dtype: object

In [138]:
#str split
s3.str.split("-")

0    [A, 1]
1    [B, 2]
2    [C, 3]
dtype: object

In [139]:
#str.replace
s3.str.replace(pat="-", repl="_")

0    A_1
1    B_2
2    C_3
dtype: object

In [140]:
#un nuevo df
s = pd.Series(["gato", "perro", "elefante"])

In [141]:
#upper
s.str.upper()

0        GATO
1       PERRO
2    ELEFANTE
dtype: object

In [142]:
#len
s.str.len()

0    4
1    5
2    8
dtype: int64

In [143]:
#count
s.str.count("o")

0    1
1    1
2    0
dtype: int64

In [144]:
#un nuevo df
s4 = pd.Series(["_A_", "_B_", "_C_", "_D_"])
s4

0    _A_
1    _B_
2    _C_
3    _D_
dtype: object

In [145]:
s4.str.strip("_")

0    A
1    B
2    C
3    D
dtype: object

# Series de tiempo

Pandas utiliza el tipo de dato "Timestamp" para el manejo de fechas y tiempo.

## String a Timestamp

In [146]:
# Convención norteamericana
ts_index = pd.to_datetime(["10/09/2006", "11/09/2006", "12/09/2006"])
ts_index

DatetimeIndex(['2006-10-09', '2006-11-09', '2006-12-09'], dtype='datetime64[ns]', freq=None)

In [147]:
# Convención mexicana
ts_index = pd.to_datetime(["10/09/2006", "11/09/2006", "12/09/2006"],dayfirst=True)
ts_index

DatetimeIndex(['2006-09-10', '2006-09-11', '2006-09-12'], dtype='datetime64[ns]', freq=None)

De vuelta a string:
1. Conversión usando astype()
2. Conversión usando strftime()

In [148]:
# usando astype()
ts_index.astype(str)

Index(['2006-09-10', '2006-09-11', '2006-09-12'], dtype='object')

In [149]:
# usando strftime()
ts_index.strftime("%d/%m/%y")

Index(['10/09/06', '11/09/06', '12/09/06'], dtype='object')

Lapso entre tiempos

In [150]:
ts_index = pd.to_datetime(["10/09/2006 23:59:00", "11/09/2006 00:01:00", "12/09/2006 13:15:45"],dayfirst=True)

lapso = pd.to_timedelta([ts_index[1]-ts_index[0],ts_index[2]-ts_index[1]])
print(lapso)
lapso_en_segundos = lapso.seconds
print(lapso_en_segundos)

TimedeltaIndex(['0 days 00:02:00', '1 days 13:14:45'], dtype='timedelta64[ns]', freq=None)
Int64Index([120, 47685], dtype='int64')

Creando una serie de tiempo desde objetos:

In [151]:
ts = pd.Series(["5", "10", "15"], index=ts_index)
ts

2006-09-10 23:59:00     5
2006-09-11 00:01:00    10
2006-09-12 13:15:45    15
dtype: object

Creando una serie de tiempo usando aleatoriamente usando Numpy y date_range de Pandas:

In [152]:
ts = pd.Series(np.random.normal(0, 1, 100), index=pd.date_range(start="2006-01-01", periods=100, freq="D"))
ts.head(10)

2006-01-01    0.334671
2006-01-02   -0.252711
2006-01-03   -0.108008
2006-01-04    0.069444
2006-01-05    2.721053
2006-01-06   -1.461514
2006-01-07    1.348079
2006-01-08    0.769790
2006-01-09   -0.253353
2006-01-10   -0.168368
Freq: D, dtype: float64

## Indexing

Puedes utilizar fechas para indexar una serie de tiempo:

In [153]:
#usando el anio y mes como indice
ts["2006-02"]

2006-02-01    0.979761
2006-02-02    1.710267
2006-02-03   -1.120477
2006-02-04   -0.666152
2006-02-05   -0.740381
2006-02-06   -0.506018
2006-02-07   -0.885783
2006-02-08    1.251408
2006-02-09    0.653048
2006-02-10   -0.315343
2006-02-11    1.763150
2006-02-12   -0.150816
2006-02-13    0.426061
2006-02-14   -1.521729
2006-02-15   -2.056044
2006-02-16    1.619578
2006-02-17   -2.178541
2006-02-18   -1.784606
2006-02-19   -1.274938
2006-02-20    0.816355
2006-02-21   -1.487942
2006-02-22    0.388633
2006-02-23   -1.208540
2006-02-24    0.256351
2006-02-25   -1.499299
2006-02-26   -0.402451
2006-02-27    0.143937
2006-02-28   -0.610698
Freq: D, dtype: float64

In [154]:
#una rebanada entre fechas
ts["2006-02-20": "2006-03-10"]

2006-02-20    0.816355
2006-02-21   -1.487942
2006-02-22    0.388633
2006-02-23   -1.208540
2006-02-24    0.256351
2006-02-25   -1.499299
2006-02-26   -0.402451
2006-02-27    0.143937
2006-02-28   -0.610698
2006-03-01    1.601935
2006-03-02    0.157148
2006-03-03    1.469959
2006-03-04   -0.612729
2006-03-05    0.090123
2006-03-06    1.795753
2006-03-07   -0.489440
2006-03-08    1.789238
2006-03-09    0.867823
2006-03-10    0.146770
Freq: D, dtype: float64

## Resampling / agregación

Permite obtener desde una serie de tiempo una nueva serie de tiempo a una frecuencia de tiempo menor al agregar los datos.

In [155]:
#De frecuencia por dias a semanas
ts.resample("W").mean()

2006-01-01    0.334671
2006-01-08    0.440876
2006-01-15   -0.222050
2006-01-22   -0.069276
2006-01-29    0.013593
2006-02-05   -0.072073
2006-02-12    0.258521
2006-02-19   -0.967174
2006-02-26   -0.448127
2006-03-05    0.319954
2006-03-12    0.777557
2006-03-19   -0.182079
2006-03-26   -0.256085
2006-04-02    0.284478
2006-04-09    0.389597
2006-04-16    0.328177
Freq: W-SUN, dtype: float64

## Ventanas

Puedes aplicar [ventanas deslizantes a series de tiempo](https://pandas.pydata.org/pandas-docs/stable/reference/window.html#window) para calcular distintos estadísticos.

In [156]:
ts.rolling(window=7).mean().head(14)

2006-01-01         NaN
2006-01-02         NaN
2006-01-03         NaN
2006-01-04         NaN
2006-01-05         NaN
2006-01-06         NaN
2006-01-07    0.378716
2006-01-08    0.440876
2006-01-09    0.440784
2006-01-10    0.432162
2006-01-11    0.514415
2006-01-12    0.110166
2006-01-13    0.374717
2006-01-14    0.015801
Freq: D, dtype: float64